Ran Plan for 2 projects:

1. project: `iam/zerone-id` dir: `terraform/iam/zerone-id` workspace: `default`
1. project: `s3/zerone-id` dir: `terraform/s3/zerone-id` workspace: `default`

### 1. project: `iam/zerone-id` dir: `terraform/iam/zerone-id` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # aws_iam_role_policy.gitaction_ecs will be destroyed
  # (because aws_iam_role_policy.gitaction_ecs is not in configuration)
- resource "aws_iam_role_policy" "gitaction_ecs" {
      - id     = "gitaction:gitaction-ecs" -> null
      - name   = "gitaction-ecs" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecs:RegisterTaskDefinition",
                          - "ecs:DescribeTaskDefinition",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "RegisterTaskDefinition"
                    },
                  - {
                      - Action   = "iam:PassRole"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::066346343248:role/demo-tmcdapne2-task-exec",
                          - "arn:aws:iam::066346343248:role/demo-tmcdapne2-task",
                        ]
                      - Sid      = "PassRolesInTaskDefinition"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role   = "gitaction" -> null
    }

  # aws_iam_role_policy.gitaction_s3 will be created
+ resource "aws_iam_role_policy" "gitaction_s3" {
      + id          = (known after apply)
      + name        = "gitaction-s3"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:PutObject"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowAccessS3Bucket"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "gitaction"
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p iam/zerone-id`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.terraform.devart.tv/lock?id=DevopsArtFactory%252Fterraform-provisioning%252Fterraform%252Fiam%252Fzerone-id%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p iam/zerone-id`
</details>
Plan: 1 to add, 0 to change, 1 to destroy.

---
### 2. project: `s3/zerone-id` dir: `terraform/s3/zerone-id` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.tmc-sample_deploymentbucket_policy_document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "tmc-sample_deploymentbucket_policy_document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetBucketLocation",
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "066346343248",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "066346343248",
                ]
              + type        = "AWS"
            }
        }
    }

  # aws_s3_bucket.tmc-sample_deployment will be created
+ resource "aws_s3_bucket" "tmc-sample_deployment" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "tmc-service-deployment"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_accelerate_configuration.tmc-sample_deploymentaccelerate_configuration will be created
+ resource "aws_s3_bucket_accelerate_configuration" "tmc-sample_deploymentaccelerate_configuration" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + status = "Enabled"
    }

  # aws_s3_bucket_lifecycle_configuration.tmc-sample_deployment_lifecycle_configuration will be created
+ resource "aws_s3_bucket_lifecycle_configuration" "tmc-sample_deployment_lifecycle_configuration" {
      + bucket                                 = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = (known after apply)

      + rule {
          + id     = "intelligent-tiering"
          + status = "Enabled"

          + transition {
              + days          = 3
              + storage_class = "INTELLIGENT_TIERING"
            }
        }
    }

  # aws_s3_bucket_policy.tmc-sample_deploymentbucket_policy will be created
+ resource "aws_s3_bucket_policy" "tmc-sample_deploymentbucket_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p s3/zerone-id`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.terraform.devart.tv/lock?id=DevopsArtFactory%252Fterraform-provisioning%252Fterraform%252Fs3%252Fzerone-id%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p s3/zerone-id`
</details>
Plan: 4 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
